In [16]:
import pandas as pd
import numpy as np

#### sorting by column values

In [17]:
df = pd.DataFrame({'Name' : ['A', 'B', 'C', 'Z', 'D'], 'age' : [15,21,19, np.nan, 16], 'salary' : [400, np.nan, 600, 600, 200]})
df

  Name   age  salary
0    A  15.0   400.0
1    B  21.0     NaN
2    C  19.0   600.0
3    Z   NaN   600.0
4    D  16.0   200.0

In [18]:
df.sort_values(by= 'age')

  Name   age  salary
0    A  15.0   400.0
4    D  16.0   200.0
2    C  19.0   600.0
1    B  21.0     NaN
3    Z   NaN   600.0

In [19]:
df.sort_values(by = ['age'], ascending = False)

  Name   age  salary
1    B  21.0     NaN
2    C  19.0   600.0
4    D  16.0   200.0
0    A  15.0   400.0
3    Z   NaN   600.0

In [20]:
df.sort_values(by = ['salary', 'age'], ascending = [False, True])

  Name   age  salary
2    C  19.0   600.0
3    Z   NaN   600.0
0    A  15.0   400.0
4    D  16.0   200.0
1    B  21.0     NaN

In [22]:
df.sort_values(by = ['salary', 'age'], ascending = [False, True], na_position = 'first')     # default na_position = 'last'

  Name   age  salary
1    B  21.0     NaN
3    Z   NaN   600.0
2    C  19.0   600.0
0    A  15.0   400.0
4    D  16.0   200.0

#### Sorting by index

In [23]:
s = pd.Series([6,7,3,1,4,2], index= ['a', 'b', 'z', 'm', 'p', 'c'])

In [24]:
s

a    6
b    7
z    3
m    1
p    4
c    2
dtype: int64

In [25]:
s.sort_index()

a    6
b    7
c    2
m    1
p    4
z    3
dtype: int64

In [26]:
s.sort_index(ascending=False)

z    3
p    4
m    1
c    2
b    7
a    6
dtype: int64

In [28]:
s.sort_index()

a    6
b    7
c    2
m    1
p    4
z    3
dtype: int64

In [33]:
df1 = pd.DataFrame({'a' :[1,2,3], 'b':[3,2,1]}, index=['x', 'z', 'w'])
df1

   a  b
x  1  3
z  2  2
w  3  1

In [36]:
df1.sort_index(axis=1)

   a  b
x  1  3
z  2  2
w  3  1